<template>
  <tmpl :data="data" :date="date" />
</template>

<script setup lang="ts">
import Tmpl from '../tmpl.vue'
const data: [string, string[]][] = [
  ['新功能', [
    '增加更新日志查看功能。',
    '新增下载分析查看相关功能，需要授权方可访问。',
    '新增客户端新版本提示功能。',
    '集成标注浏览器。'
  ]],
  ['修复', [
    '课题详情返回课题列表时默认刷新第一页改为刷新当前页。',
    '过滤场景如下拉选择框等过滤功能针对正则特殊字符过滤结果不准确的问题修改。'
  ]],
  ['调整', [
    '平台所有图表在暗黑模式下背景样式调整。',
    '去除用户手册访问入口。',
    '数据集管理权限、数据集详情业务权限调整。数据集仅可由课题负责人创建、修改和删除；创建数据集时可分配收集人、使用人、标注人、审核人，不同角色拥有不同的业务权限，数据集创建人（课题负责人）拥有全部业务权限。',
    '数据集详情页面数据列表增加数据状态展示字段，增加数据状态、数据范围筛选字段，增加审核按钮。',
    '数据集详情页面点击标注、审核按钮后增加友好提示。',
    '数据概览页面厂商列表增加fallback展示。'
  ]],
  ['优化', [
    '平台所有表格组件改为使用虚拟列表方式，优化渲染速度。'
  ]]
]
const date = '2023-12-06'
</script>
